//GPAZ99J3 JOB SATOSHI,MSGCLASS=X,CLASS=C,NOTIFY=GPAZ99,TIME=(0,20)
//*****************************************************************
//* LER DADOS DA SYSIN - REGISTRO COM '99...99' INDICA FIM DOS REG.
//*****************************************************************
//STEP1   EXEC PGM=V2051P2
//STEPLIB DD DSN=GP.GERAL.LOADLIB,DISP=SHR
//SYSIN   DD *
IN001BOLA REI PELE  1315SP15799
IN005BONECA BARBIE  0135RJ08500
UD032BACIA METALICA 0060RJ03250
UD076BALDE DE GELO  0105SP03590
99999999999999999999999999999999999999999999999
//*
//P2JOBV  DD DSN=GP.GPAZ99.RS003.P2CADV,DISP=(OLD,CATLG,DELETE),
//        SPACE=(TRK,(1,1)),UNIT=SYSALLDA,
//        DCB=(LRECL=70,RECFM=FB,DSORG=PS)
//*
