//GPAZ99J2 JOB SATOSHI,MSGCLASS=X,CLASS=C,NOTIFY=GPAZ99,TIME=(0,20)
//*****************************************************************
//* LER DADOS DA SYSIN - REGISTRO COM '99...99' INDICA FIM DOS REG.
//*****************************************************************
//STEP1   EXEC PGM=T2051PRG
//STEPLIB DD DSN=GP.GERAL.LOADLIB,DISP=SHR
//SYSIN   DD *
5555MG0510450S37501789
6666MG0350300N28700557
7777RS1330200S83217841
8888RS0887000S72474850
9999999999999999999999
//*
